## Importación de librearías

In [2]:
import pandas as pd
import numpy as np
import os
import dateparser

## Carga de datos
Vamos a tratar las columnas de fecha como tipo de dato datetime (PENDIENTE)

In [3]:
ruta_customer = r"C:\Users\HUGO\Desktop\Data Analyst\09_PYTHON\Proyecto_Python_Data\data\Archivos_origen\customer-details.xlsx"
df_customer = pd.read_excel(ruta_customer, index_col=0)
pd.set_option("display.max_columns", None)
df_customer.head()

## uso la primera columna como índice y elimino la Unnamed: 0

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [4]:
## incluyo la información de las columnas para análisis de sus valores

df_customer.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20115 entries, 0 to 20114
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Income             20115 non-null  int64
 1   Kidhome            20115 non-null  int64
 2   Teenhome           20115 non-null  int64
 3   Dt_Customer        20115 non-null  datetime64[ns]
 4   NumWebVisitsMonth  20115 non-null  int64
 5   ID                 20115 non-null  object
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 1.1+ MB

In [5]:
ruta_bank = r"C:\Users\HUGO\Desktop\Data Analyst\09_PYTHON\Proyecto_Python_Data\data\Archivos_origen\bank-additional.csv"
df_bank = pd.read_csv(ruta_bank, index_col=0, encoding='utf-8')

df_bank.head()

## uso la primera columna como índice y elimino la Unnamed: 0

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [7]:
## incluyo la información de las columnas para análisis de sus valores

df_bank.info()

<class 'pandas.core.frame.DataFrame'>
Index: 43000 entries, 0 to 27570
Data columns (total 23 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             37880 non-null  float64
 1   job             42655 non-null  object
 2   marital         42915 non-null  object
 3   education       41193 non-null  object
 4   default         34019 non-null  float64
 5   housing         41974 non-null  float64
 6   loan            41974 non-null  float64
 7   contact         43000 non-null  object
 8   duration        43000 non-null  int64
 9   campaign        43000 non-null  int64
 10  pdays           43000 non-null  int64
 11  previous        43000 non-null  int64
 12  poutcome        43000 non-null  object
 13  emp.var.rate    43000 non-null  float64
 14  cons.price.idx  42529 non-null  object
 15  cons.conf.idx   43000 non-null  object
 16  euribor3m       33744 non-null  object
 17  nr.employed     43000 non-null  object
 18  y               43000 non-null  object
 19  date            42752 non-null  object
 20  latitude        43000 non-null  float64
 21  longitude       43000 non-null  float64
 22  id_             43000 non-null  object
dtypes: float64(7), int64(4), object(12)
memory usage: 7.9+ MB

### Análisis preliminar df_customer

In [8]:

print("===== Análisis de tipos en Customers =====")

# Fechas
fechas_customer = df_customer.select_dtypes(include=["datetime64[ns]"]).columns.tolist()
print("\nColumnas de tipo FECHA:")
print(fechas_customer if fechas_customer else "Ninguna")

# Numéricos
numericos_customer = df_customer.select_dtypes(include=["int64", "float64"]).columns.tolist()
print("\nColumnas de tipo NUMÉRICO:")
print(numericos_customer if numericos_customer else "Ninguna")

# Texto / Categórico
texto_customer = df_customer.select_dtypes(include=["object", "category"]).columns.tolist()
print("\nColumnas de tipo TEXTO / CATEGÓRICO:")
print(texto_customer if texto_customer else "Ninguna")

# Resumen de valores únicos por columna categórica
print("\nValores únicos por columna categórica:")
for col in texto_customer:
    print(f"- {col}: {df_customer[col].nunique()} valores únicos")

===== Análisis de tipos en Customers =====

Columnas de tipo FECHA:
['Dt_Customer']

Columnas de tipo NUMÉRICO:
['Income', 'Kidhome', 'Teenhome', 'NumWebVisitsMonth']

Columnas de tipo TEXTO / CATEGÓRICO:
['ID']

Valores únicos por columna categórica:
- ID: 20115 valores únicos

In [12]:
# ==============================
# Análisis detallado en tabla - Customers
# ==============================

print("===== Customers - Variables de tipo FECHA =====")
fechas_customer = df_customer.select_dtypes(include=["datetime64[ns]"]).columns
for col in fechas_customer:
    print(f"\nColumna: {col}")
    print("Mínimo:", df_customer[col].min())
    print("Máximo:", df_customer[col].max())
    print("Rango:", df_customer[col].max() - df_customer[col].min())

print("\n===== Customers - Variables NUMÉRICAS =====")
resumen_num_customer = df_customer[numericos_customer].describe().T.round(2)
display(resumen_num_customer)

print("\n===== Customers - Variables CATEGÓRICAS =====")
resumen_cat_customer = pd.DataFrame({
    "Valores únicos": df_customer[texto_customer].nunique(),
    "Valores nulos": df_customer[texto_customer].isnull().sum()
})
display(resumen_cat_customer)

===== Customers - Variables de tipo FECHA =====

Columna: Dt_Customer
Mínimo: 2012-01-01 00:00:00
Máximo: 2012-12-31 00:00:00
Rango: 365 days 00:00:00

===== Customers - Variables NUMÉRICAS =====

,count,mean,std,min,25%,50%,75%,max
Income,20115.0,93087.21,50614.80,5852.0,49110.0,92962.0,136705.0,180791.0
Kidhome,20115.0,1.00,0.82,0.0,0.0,1.0,2.0,2.0
Teenhome,20115.0,1.00,0.82,0.0,0.0,1.0,2.0,2.0
NumWebVisitsMonth,20115.0,16.54,9.24,1.0,9.0,16.0,25.0,32.0

===== Customers - Variables CATEGÓRICAS =====

    Valores únicos  Valores nulos
ID           20115              0

### Análisis preliminar df_bank

In [9]:

print("\n===== Análisis de tipos en Bank =====")

# Fechas
fechas_bank = df_bank.select_dtypes(include=["datetime64[ns]"]).columns.tolist()
print("\nColumnas de tipo FECHA:")
print(fechas_bank if fechas_bank else "Ninguna")

# Numéricos
numericos_bank = df_bank.select_dtypes(include=["int64", "float64"]).columns.tolist()
print("\nColumnas de tipo NUMÉRICO:")
print(numericos_bank if numericos_bank else "Ninguna")

# Texto / Categórico
texto_bank = df_bank.select_dtypes(include=["object", "category"]).columns.tolist()
print("\nColumnas de tipo TEXTO / CATEGÓRICO:")
print(texto_bank if texto_bank else "Ninguna")

# Resumen de valores únicos por columna categórica
print("\nValores únicos por columna categórica:")
for col in texto_bank:
    print(f"- {col}: {df_bank[col].nunique()} valores únicos")

===== Análisis de tipos en Bank =====

Columnas de tipo FECHA:
Ninguna

Columnas de tipo NUMÉRICO:
['age', 'default', 'housing', 'loan', 'duration', 'campaign', 'pdays', 'previous', 'emp.var.rate', 'latitude', 'longitude']

Columnas de tipo TEXTO / CATEGÓRICO:
['job', 'marital', 'education', 'contact', 'poutcome', 'cons.price.idx', 'cons.conf.idx', 'euribor3m', 'nr.employed', 'y', 'date', 'id_']

Valores únicos por columna categórica:
- job: 11 valores únicos
- marital: 3 valores únicos
- education: 7 valores únicos
- contact: 2 valores únicos
- poutcome: 3 valores únicos
- cons.price.idx: 26 valores únicos
- cons.conf.idx: 26 valores únicos
- euribor3m: 309 valores únicos
- nr.employed: 11 valores únicos
- y: 2 valores únicos
- date: 1825 valores únicos
- id_: 43000 valores únicos

In [15]:
# ==============================
# Análisis detallado en tabla - Bank
# ==============================

print("===== Bank - Variables de tipo FECHA =====")
fechas_bank = df_bank.select_dtypes(include=["datetime64[ns]"]).columns
for col in fechas_bank:
    print(f"\nColumna: {col}")
    print("Mínimo:", df_bank[col].min())
    print("Máximo:", df_bank[col].max())
    print("Rango:", df_bank[col].max() - df_bank[col].min())

print("\n===== Bank - Variables NUMÉRICAS =====")
resumen_num_bank = df_bank[numericos_bank].describe().T.round(2)
display(resumen_num_bank)

print("\n===== Bank - Variables CATEGÓRICAS =====")
resumen_cat_bank = pd.DataFrame({
    "Valores únicos": df_bank[texto_bank].nunique(),
    "Valores nulos": df_bank[texto_bank].isnull().sum()
})
display(resumen_cat_bank)

===== Bank - Variables de tipo FECHA =====

===== Bank - Variables NUMÉRICAS =====

                count    mean     std    min     25%     50%     75%      max
age           37880.0   39.98   10.44   17.0   32.00   38.00   47.00    98.00
default       34019.0    0.00    0.01    0.0    0.00    0.00    0.00     1.00
housing       41974.0    0.54    0.50    0.0    0.00    1.00    1.00     1.00
loan          41974.0    0.16    0.36    0.0    0.00    0.00    0.00     1.00
duration      43000.0  257.74  258.67    0.0  102.00  179.00  319.00  4918.00
campaign      43000.0    2.57    2.77    1.0    1.00    2.00    3.00    56.00
pdays         43000.0  962.33  187.26    0.0  999.00  999.00  999.00   999.00
previous      43000.0    0.17    0.50    0.0    0.00    0.00    0.00     7.00
emp.var.rate  43000.0    0.08    1.57   -3.4   -1.80    1.10    1.40     1.40
latitude      43000.0   36.86    7.23   24.4   30.61   36.76   43.11    49.38
longitude     43000.0  -95.94   16.75 -125.0 -110.49  -95.90  -81.43   -66.94

===== Bank - Variables CATEGÓRICAS =====

                Valores únicos  Valores nulos
job                         11            345
marital                      3             85
education                    7           1807
contact                      2              0
poutcome                     3              0
cons.price.idx              26            471
cons.conf.idx               26              0
euribor3m                  309           9256
nr.employed                 11              0
y                            2              0
date                      1825            248
id_                      43000              0